# UPatternIndent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..UPatternIndent Property
DividedSurface Class See Also
---
The offset applied to the pattern by an integral number of grid nodes in the U-direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int UPatternIndent { get; set; }
```

Visual Basic
---
```text
Public Property UPatternIndent As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int UPatternIndent {
	int get ();
	void set (int value);
}
```

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace